---
type: ElementArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ElementArray

`Autodesk.Revit.DB.ElementArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementArray | — | `public ElementArray ()` |
| Method | Append | — | `public virtual void Append ( Element item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ElementArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Element item , int index )` |
| Method | ReverseIterator | — | `public virtual ElementArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Element this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |